{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Diploma Web Development",
      "department": "Computer Science",
      "duration": "2022",
      "school_name": "Concordia University"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor's Degree Business Administration",
      "department": "Management Science",
      "duration": "2008-2012",
      "school_name": "Mohammed V Souissi University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-MhammedDoukkali/",
  "highlighted_projects": [
    {
      "description": "Developed full-stack web application that provides comprehensive information on both physical and mental health. Users can access a wide range of health-related articles on various topics, as well as track their physical activity and mental health using external REST APIs. Additionally, we have implemented a map feature focused on Montreal that allows users to find healthcare professionals and facilities for both physical and mental health. The application uses cutting-edge technologies such as JavaScript, React.js, Node.js, Express.js, HTTP, and REST APIs, and we store user data securely in a MongoDB database.To ensure a seamless and user-friendly experience, we have utilized popular UI frameworks such as Material UI and Styled Components. Our code is hosted on GitHub, making it easy for developers to contribute and collaborate on the project.",
      "name": "ReachOut"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a monitoring agent in Bash that records the hardware specifications and usage of host machines over time and saves the data to a Postgres database running in a Docker container. The testing process involved using a CentOS 7 virtual machine on the Google Cloud Platform, and each script was manually tested to confirm that output expectations were met.",
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-MhammedDoukkali/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Designed a Twitter application that follows the MVC (Model-View-Controller) architecture, enabling users to execute CRUD operations via REST API. To build the application, I utilized various libraries such as Twitter API, HTTP client, OAuth authorization, and JSON serialization. During the development process, I conducted integration tests on all Java files using JUnit. Additionally, I employed the Mockito framework to test classes with dependencies, leveraging the ability to mock those dependencies.",
        "JDBC App: Programmed a straightforward application that establishes a link between a Java program and a relational database management system (RDBMS) to access data. To enable create, read, update, and delete (CRUD) operations, I utilized the DAO (data access object) design patterns.",
        "Grep App: Developed a Java program that imitates the grep command line function. The program performs a recursive search for a given pattern within a specified root directory and writes the matching lines to an output file. To efficiently list and filter files under the root directory while reducing memory usage, I utilized the Lambda and Stream API."
      ],
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-MhammedDoukkali/tree/master/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Mhammed Doukkali",
  "others": [
    {
      "bullets": [
        "AWS Certified Developer"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Running"
      ],
      "title": "Sport"
    },
    {
      "bullets": [
        "Percussion",
        "Guitare",
        "Volunteer Guignolée Dr Julien"
      ],
      "title": "Other"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with a team using Agile/Scrum methodology to develop various back-end and data projects involving technologies and tools such as Linux, SQL, Java, and Docker.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "National Bank of Canada",
      "description": "I had a multifaceted role that involved a broad spectrum of duties. More specifically, I was responsible for meticulously analyzing loan applications to ensure they were in line with relevant policies and regulations, and scrutinizing legal documentation to confirm their accuracy and completeness. Another crucial aspect of my role was to maintain rigorous standards in the disbursement process to ensure quality outcomes for our clients.",
      "duration": "2021-2022",
      "title": "Account Officer"
    },
    {
      "company": "National Bank of Canada",
      "description": "As part of the transformation effort to enhance the customer experience, I played a key role in supporting the bank's entrepreneurial clients. Specifically, I was responsible for assisting these customers with their transactional requirements, managing their MasterCard accounts, and guiding them in the use of our electronic solutions.",
      "duration": "2018-2021",
      "title": "Technical Advisor"
    },
    {
      "company": "National Bank of Canada",
      "description": "My responsibilities involved analyzing the specific requirements of clients and providing them with expert guidance on various banking services such as opening and managing accounts, obtaining credit cards, and securing loans.",
      "duration": "2017-2018",
      "title": "Banking Specialist"
    }
  ],
  "skills": {
    "competent": [
      "Javascript",
      "ReactJS",
      "HTML/CSS",
      "MongoDB",
      "REST API"
    ],
    "familiar": [
      "Docker",
      "Terraform",
      "Android Studio",
      "NodeJS",
      "Spring"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "As dedicated software developer with a good foundation in both web development and cloud computing, I bring a strong technical foundation to my five years of experience in the banking industry. My excellent track record in collaborating with team members, coupled with my ability to proactively address the needs of both customers and the organization, has honed my communication and problem-solving skills. My passion for software engineering began while working on a project to improve the online banking application. Intrigued by the power of programming to create and build solutions, I decided to enroll in an 'Introduction to Programming' course. Quickly, I found programming to be highly accessible and was thrilled to see the immediate results of my work in just a few lines of code. Currently, as an Applications and Data Engineer at Jarvis, I have sharpened my proficiency in various technologies such as Java, Linux, and Docker. I have demonstrated my ability to work in a fast-paced environment and deliver high-quality solutions. I am eager to leverage my skills and knowledge to contribute to your team's success."
}
